import streamlit as st

#ส่วนที่ 1 หัวข้อหน้าเว็บ (Title สีแดง)
st.markdown("# :red[🏋️ คำนวนค่าดัชนีมวลกาย BMI]")
st.write("กรอกข้อมูลน้ำหนักและส่วนสูงของคุณ เพื่อเช้กสุขภาพเบื้องตน")

#ส่วนที่2 สร้างช่องรับค่าน้ำหนัก และ ส่วนสูง
weight = st.nuber_input("กรอกน้ำหนักของคุณ (กิโลกรัม):", min_value=1.0, value=1.0)
height_cm = st.number_input("กรอกส่วนสูงของคุณ (เซนติเมตร):",min_value=1.0, value=1.0)

#สวนที่3 สร้างปุมกดคำนวณ
if st.button("คำนวนค่า BMI🎯"):
  #แปลงส่วนสูงจาก cm เป็นเมตร แล้วคำนวนค่า BMI
  height_m = hei
